In [1]:
try:
    file=open('data1.csv','w')
    file.close()
except:
    print("Error")

In [3]:
import pandas as pd
df=pd.read_csv('data1.csv')
df

   sn   name  age address
0   1    Ram   12     KTM
1   2  Shyam   14     BKT
2   3   Hari   23     PKR
3   5  Guman   34     KTM
4   6   Tara   32     KTM

In [5]:
df=pd.read_csv('data1.csv',index_col='sn')
df.head()

     name  age address
sn
1     Ram   12     KTM
2   Shyam   14     BKT
3    Hari   23     PKR
5   Guman   34     KTM
6    Tara   32     KTM

In [6]:
df=pd.read_csv('data1.csv',index_col='sn')
df.tail()

     name  age address
sn
1     Ram   12     KTM
2   Shyam   14     BKT
3    Hari   23     PKR
5   Guman   34     KTM
6    Tara   32     KTM

In [7]:
df=pd.read_csv('data1.csv',index_col='sn', usecols=['sn', 'name','age'])
df

     name  age
sn
1     Ram   12
2   Shyam   14
3    Hari   23
5   Guman   34
6    Tara   32

In [8]:
df=pd.read_csv('data1.csv',index_col='sn')
df['name']

sn
1      Ram
2    Shyam
3     Hari
5    Guman
6     Tara
Name: name, dtype: object

In [9]:
df[['name','age']]

     name  age
sn
1     Ram   12
2   Shyam   14
3    Hari   23
5   Guman   34
6    Tara   32

In [10]:
# iloc = index localizer
df.iloc[0:3] 
# specific row lai matra access garna

     name  age address
sn
1     Ram   12     KTM
2   Shyam   14     BKT
3    Hari   23     PKR

In [11]:
df.iloc[0:3, 0:2]
# paxadi ko 0:2 is for column

     name  age
sn
1     Ram   12
2   Shyam   14
3    Hari   23

In [12]:
df.loc[2:5]
# sn index ma xa so sn ko 2 dekhi ko value haru print garxa

     name  age address
sn
2   Shyam   14     BKT
3    Hari   23     PKR
5   Guman   34     KTM

In [13]:
import pandas as pd
df=pd.read_csv('data1.csv')
df

   sn   name  age address
0   1    Ram   12     KTM
1   2  Shyam   14     BKT
2   3   Hari   23     PKR
3   5  Guman   34     KTM
4   6   Tara   32     KTM

In [14]:
# filtering
df['name']=='Ram'
# condition check gareko

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [16]:
# filtering
df[df['name']=='Ram']
# arko df ma save gareko

   sn name  age address
0   1  Ram   12     KTM

In [17]:
df[df['age']>30]

   sn   name  age address
3   5  Guman   34     KTM
4   6   Tara   32     KTM

In [19]:
df[(df['age']>30) & (df['address']=='KTM')]

   sn   name  age address
3   5  Guman   34     KTM
4   6   Tara   32     KTM

In [21]:
data={'name':['Ram','Shyam','Hari','Sita'],
      'age':[23,24,25,26],
      'address':['KTM','BKT','PKR','BKT']
     }
df=pd.DataFrame(data)
df.to_csv('new_data.csv')
# new_data.csv aafai create hunxa
# dict lai csv ma write gareko

In [22]:
pwd

'C:\\Users\\Deepika Sainju\\Desktop\\datasc'

In [25]:
df1=pd.read_csv('new_data.csv',index_col='sn')
df1

     name  age address
sn
0     Ram   23     KTM
1   Shyam   24     BKT
2    Hari   25     PKR
3    Sita   26     BKT

In [26]:
# list inside list to csv
import csv
data=[['name','age','address'],
     ['Ram',34,'KTM'],
     ['Gita',33,'KTM']
     ]
file=open('list_file.csv','w')
obj=csv.writer(file)
obj.writerows(data)
file.close()

df=pd.read_csv('list_file.csv')
df

   name  age address
0   Ram   34     KTM
1  Gita   33     KTM

In [28]:
s="""name,age,address\nRam,34,KTM\nShyam,23,KTM"""
print(s)
file=open('stirng_file.csv','w')
file.write(s)
file.close()

name,age,address
Ram,34,KTM
Shyam,23,KTM

In [29]:
df2=pd.read_csv('stirng_file.csv')
df2

    name  age address
0    Ram   34     KTM
1  Shyam   23     KTM

In [31]:
import csv
data=[]
file= open('stirng_file.csv')
reader=csv.DictReader(file)
for row in reader:
    data.append(row)
file.close()
data

[{'name': 'Ram', 'age': '34', 'address': 'KTM'},
 {'name': 'Shyam', 'age': '23', 'address': 'KTM'}]

In [32]:
data1={'name':['Ram','Shyam','Hari','Sita'],
      'age':[23,24,25,26],
      'address':['KTM','BKT','PKR','BKT']
     }
df1=pd.DataFrame(data1)

data2={'name':['Ram','Shyam','Hari','Sita'],
      'age':[23,24,25,26],
      'address':['KTM','BKT','PKR','BKT']
     }
df2=pd.DataFrame(data2)

df=pd.concat([df1,df2])
df

    name  age address
0    Ram   23     KTM
1  Shyam   24     BKT
2   Hari   25     PKR
3   Sita   26     BKT
0    Ram   23     KTM
1  Shyam   24     BKT
2   Hari   25     PKR
3   Sita   26     BKT